[{"name":"app.R","content":"library(shiny)\nlibrary(bslib)\nlibrary(DT)\nlibrary(tibble)\n\n# Your data with added USERINPUT column (removed ID column)\ninitial_data <- tribble(\n  ~USERINPUT, ~Action, ~Details,\n  NA, \"Amalgamate Monitoring\", \"Amalgamate effectiveness monitoring information and present within online reporting to facilitate adaptive management through sharing and review. Evolve program to leverage past monitoring methodology and data include an updated monitoring schedule, monitoring objectives, and methods. Methodology using Watershed Restoration Procedures - Routine effectiveness evaluation procedures and riparian inventory techniques ([LMH25](https://www.for.gov.bc.ca/hfd/pubs/Docs/Lmh/Lmh25/Lmh25_ed2_(2010).pdf) - percent cover by structural stage, species composition, etc.) could be utilized using pre-built digital forms served to field teams from the collaborative GIS project.\",\n  NA, \"Water Quality Monitoring\", \"Design long-term water monitoring program to leverage past work and attempt to quantify upstream water quality impacts via tools such as [CABIN](https://www.canada.ca/en/environment-climate-change/services/canadian-aquatic-biomonitoring-network/resources.html) sampling program [@canada2008CanadianAquatic], 5 sample in 30 day water quality sampling during both high and low flow periods [@wlrs2024BritishColumbia; @moe2024BritishColumbia], continuation/expansion of [temperature monitoring](https://public.tableau.com/app/profile/skeena.knowledge.trust/viz/UBRWaterTemperatureMonitoringDashboardDraft/UBRWaterTemp_Dashboard) [@skeenaknowledgetrustUBRWater, @westcott2022UpperBulkleya], quantify amounts of water withdrawn by licensees in the upper Bulkley catchment during the April to September low flow period, etc. Importantly, careful consideration of how to implement water quality program recommendations from @price2014UpperBulkleya, @oliver2020Analysis2017 and @westcott2022UpperBulkleya during this process is also recommended.\",\n  NA, \"Incentivize Range Practices\", \"Incentivize and help coordinate range tenure practice improvements (off-site watering, rotational field use, riparian exclusion, monitoring, range use plan updates that reduce cattle load, range stewardship planning that includes 'red' zones for cattle exclusion, etc.) to reduce cattle impacts on riparian and water quality values. Cattle waste loading to tributary and mainstem habitats is of paramount concern as water quality degradation due to high biological oxygen demand related to nutrient loading will undermine the ability of aquatic life to recover from cumulative impacts in the watershed.\",\n  NA, \"Expand Education Programs\", \"Leverage and expand existing education programs for youth related to watershed health and cultural/ecosystem significance of fish/riparian/wildlife values to provide outreach for all school-aged and post-secondary students in the greater Skeena region.\",\n  NA, \"Seed Collection Program\", \"Work with organizations such as the Woodmere Nursery, Skeena-based 'Seed the North', knowledge holders, and others to develop a local seed collection and propagation program to increase capacity for floodplain revegetation that can be scaled up to meet the challenges faced by historic removal of these native vegetation communities.\",\n  NA, \"Streambank Armoring Best Practices\", \"In our recent field assessments, we observed that the protection of road and rail infrastructure through streambank armoring is not adequately incorporating best practices for vegetating riprap, soft armoring where possible and establishing/restoring effective riparian buffers. This oversight can significantly impact watershed health and biodiversity. To address this issue, we recommend collaborating with relevant stakeholders to advocate for the documentation, evolution, and dissemination of best practices related to streambank armoring.\",\n  NA, \"On-Ground Monitoring Schedule\", \"Develop a schedule for on-the-ground monitoring via pre-planned instream surveys (walks) of mainstem and tributary habitats and riparian recovery/monitoring. Map these 'trail' systems and document values within them. Increasing the presence of First Nation representatives, environmental practitioners, and regulators within valuable streams within the Neexdzi Kwa watershed - regardless of land ownership - will help educate surveyors on the current state of these systems, provide information regarding recovery effort results, and incentivize responsible land management by landowners/managers in the region.\",\n  NA, \"Prioritize Recovery Programs\", \"Select and refine parameters to prioritize future recovery program types (ex. water quality monitoring, range management program, education initiative, riparian vegetation recovery, expanded seed collection/propagation program, erosion protection, etc.) and allocate available dollars accordingly. After financial and capacity resources are delineated by recovery program type - select parameters and weight a ranking system for each to inform prioritization of specific sites within each recovery program. For physical actions such as riparian fencing for cattle exclusion, riparian/floodplain vegetation recovery, and erosion protection include prioritization criteria that incorporates the amount of riparian/floodplain area available for recovery (i.e., the wider the buffer available for meaningful native floodplain vegetation community establishment - the higher the priority for investment). Utilize established standards when possible such as the [Riparian Areas Protection Regulation](https://www2.gov.bc.ca/gov/content/environment/plants-animals-ecosystems/fish/aquatic-habitat-management/riparian-areas-regulation) and the [Riparian Management Area Guidebook](https://www2.gov.bc.ca/gov/content/industry/forestry/managing-our-forest-resources/silviculture/silvicultural-systems/silviculture-guidebooks/riparian-management-area-guidebook) [@ministryofforests1995RiparianManagement].\",\n  NA, \"Quantify and Promote Beaver Activity\", \"Working with watershed users—including industrial players like railways and highways, as well as landowners and range tenure holders—is essential for promoting water retention through beaver activity. The Beaver Restoration Assessment Tool (BRAT) can guide efforts by identifying areas where beaver activity can optimize water retention and flow regulation. Beavers are natural ecosystem engineers; their dams slow water flow, enhance groundwater recharge, and reduce flood risks, while also improving water quality by trapping sediments and filtering pollutants. Providing incentives to landowners and tenure holders to support water retention on the landscape can help catalyze beaver-influenced wetlands throughout the watershed, addressing potential land use conflicts while aligning ecological goals with economic interests.  Encourage reporting of number of beavers trapped and killed by the railway, highways, trappers and landowners.\",\n  NA, \"Historic Aerial Imagery Analysis\", \"Acquire, georeference, archive (within SKT) and analyze historic aerial imagery for the Neexdzii Kwah watershed and compare with recent orthoimagery and/or LiDAR data to quantify historic changes in stream morphology and floodplain extent resulting in loss of quantity and quality of water and fish habitat while highlighting areas of historic dredging, realignment, and floodplain disconnections due to infrastructure, to guide future restoration efforts. Script all analysis when possible to facilitate reproducibility and sharing of the analysis.\",\n  NA, \"Data Management Workflows\", \"Continue to develop and document data management workflows to leverage existing established data storage systems to retrieve data from and load to and build capacity for all interested to do the same. Established data storage systems include the [BC Data Catalogue](https://catalogue.data.gov.bc.ca/), the [Skeena Salmon Data Centre](https://data.skeenasalmon.info/), [NuSEDS-New Salmon Escapement Database System](https://open.canada.ca/data/en/dataset/c48669a3-045b-400d-b730-48aafe8c5ee6) and [bcfishpass](https://github.com/smnorris/bcfishpass/tree/main/data).\",\n  NA, \"Drone Ortho-imagery\", \"Amalgamate drone-acquired ortho-imagery gathered for sites in the Neexdzii Kwah watershed, store as Cloud Optimized Geotiffs on a cloud service provider and link to the imagery via the collaborative GIS project. Orthoimagery has been gathered for past monitoring of historic restoration sites as well as part of fish passage restoration planning efforts.\",\n  NA, \"Watershed Drainage Analysis\", \"Link historic and potential future sites to the freshwater atlas using the linear feature ID of stream segments and conduct watershed drainage area analysis for individual stream segments (or portions of stream segments) so that this area can be tied to other GIS and user input parameters. Functions kept in [fwapg](https://github.com/smnorris/fwapg), [fwapgr](https://github.com/poissonconsulting/fwapgr), [fwatlasbc](https://github.com/poissonconsulting/fwatlasbc) and custom functions developed for this project can be used. Results from this can be compared to other methods for determining project setbacks from the high water mark such as the [Riparian Areas Protection Regulation](https://www2.gov.bc.ca/gov/content/environment/plants-animals-ecosystems/fish/aquatic-habitat-management/riparian-areas-regulation) and the [Riparian Management Area Guidebook](https://www2.gov.bc.ca/gov/content/industry/forestry/managing-our-forest-resources/silviculture/silvicultural-systems/silviculture-guidebooks/riparian-management-area-guidebook) [@ministryofforests1995RiparianManagement].\",\n  NA, \"Historic Fisheries Mapping\", \"Spatially represent historic fisheries sites presented in Table @ref(tab:tab-hist-sites) so the option is available that potential areas of restoration can be ranked according to their proximity to these sites.\",\n  NA, \"High Fisheries Value Areas\", \"Spatially delineate areas of high fisheries values based on known spawning and rearing habitat for fish species of interest. Where data gaps exist, develop study plans to understand where this high-value habitat is and quantify its value for fish species of interest through standardized methodologies such as Fish and Fish Habitat Assessment Procedures [@johnstonFishHabitatAssessment1996]. For known spawning and rearing locations, load reviewed data into `bcfishpass` using the `user_habitat_classification.csv` file located [here](https://github.com/smnorris/bcfishpass/blob/main/data/user_habitat_classification.csv) so it can be pulled into the collaborative GIS project and queried to facilitate priority ranking of areas of high fisheries values.\"\n)\n\nui <- page_fluid(\n  theme = bs_theme(),\n  title = \"Priority Rating Tool\",\n\n  card(\n    card_header(\n      div(style = \"display: flex; justify-content: space-between; align-items: center;\",\n          span(\"Interactive Priority Table - TO BE SIMPLIFIED SOON!!!!\"),\n          actionButton(\"sort_btn\", \"Sort by Priority Rating\", class = \"btn-sm btn-primary\")\n      )\n    ),\n    div(style = \"padding: 15px;\",\n        p(\"Click in the USERINPUT column to add your priority ratings (any positive number)\"),\n        DTOutput(\"table\", width = \"100%\"),\n        # Add a div for showing validation messages\n        div(id = \"validation_message\", style = \"color: red; margin-top: 10px;\")\n    )\n  )\n)\n\nserver <- function(input, output, session) {\n  rv <- reactiveVal(initial_data)\n\n  output$table <- renderDT({\n    datatable(\n      rv(),\n      selection = 'none',\n      rownames = FALSE,\n      escape = FALSE,\n      editable = list(\n        target = \"cell\",\n        disable = list(columns = c(1, 2))\n      ),\n      options = list(\n        pageLength = 15,\n        dom = 't',\n        ordering = FALSE,\n        columnDefs = list(\n          list(\n            targets = 0,\n            createdCell = JS(\"function(td, cellData, rowData, row, col) {\n              $(td).css('background-color', '#f0f8ff');\n              $(td).css('cursor', 'pointer');\n              $(td).css('font-weight', 'bold');\n              if(cellData === null || cellData === '' || cellData === 'NA') {\n                $(td).html('Click to rate!');\n                $(td).css('color', '#666');\n                $(td).css('font-style', 'italic');\n              }\n            }\")\n          )\n        )\n      )\n    ) %>%\n      formatStyle(\n        'Details',\n        backgroundColor = 'white',\n        color = 'black'\n      )\n  }, server = FALSE)\n\n  # Handle cell edits with improved validation feedback\n  observeEvent(input$table_cell_edit, {\n    info <- input$table_cell_edit\n    current_data <- rv()\n\n    # Convert input to numeric and validate\n    new_value <- suppressWarnings(as.numeric(info$value))\n\n    if (is.na(new_value)) {\n      # Show error for non-numeric input\n      runjs(\"document.getElementById('validation_message').innerHTML = 'Please enter a valid number.'\")\n    } else if (new_value <= 0) {\n      # Show error for negative or zero input\n      runjs(\"document.getElementById('validation_message').innerHTML = 'Please enter a positive number.'\")\n    } else {\n      # Valid input: update data and clear message\n      current_data$USERINPUT[info$row] <- new_value\n      rv(current_data)\n      runjs(\"document.getElementById('validation_message').innerHTML = ''\")\n    }\n  })\n\n  observeEvent(input$sort_btn, {\n    current_data <- rv()\n    idx <- order(is.na(current_data$USERINPUT), current_data$USERINPUT)\n    sorted_data <- current_data[idx, ]\n    rv(sorted_data)\n  })\n}\n\nshinyApp(ui, server)\n","type":"text"},{"name":"LICENSE","content":"Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n","type":"text"},{"name":"restoration_wedzin_kwa_2024_recomendations.Rproj","content":"Version: 1.0\n\nRestoreWorkspace: Default\nSaveWorkspace: Default\nAlwaysSaveHistory: Default\n\nEnableCodeIndexing: Yes\nUseSpacesForTab: Yes\nNumSpacesForTab: 2\nEncoding: UTF-8\n\nRnwWeave: knitr\nLaTeX: pdfLaTeX\n\nAutoAppendNewline: Yes\nStripTrailingWhitespace: Yes\n","type":"text"}]
